СостоянииЭксплуатируемогоОборудования/src/Documents/ВыбытиеОборудовантя/ВыбытиеОборудовантя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыбытиеОборудовантя</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

СостоянииЭксплуатируемогоОборудования/src/AccumulationRegisters/ОборудованиеОрганизации/ОборудованиеОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборудованиеОрганизации</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеОборудования</name>
    <type>
      <types>EnumRef.СостояниеОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭксплуатироватьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

СостоянииЭксплуатируемогоОборудования/src/Documents/ВыбытиеОборудовантя/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Дата = НачалоМесяца(Дата);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВыбытиеОборудовантя.Ссылка,
	|	ВыбытиеОборудовантя.Представление
	|ИЗ
	|	Документ.ВыбытиеОборудовантя КАК ВыбытиеОборудовантя
	|ГДЕ
	|	ВыбытиеОборудовантя.Дата = &Дата
	|	И ВыбытиеОборудовантя.Ссылка <> &Ссылка
	|	И ВыбытиеОборудовантя.Проведен";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон("На указанный месяц уже введен документ: %1", ВыборкаДетальныеЗаписи.Представление);
	Сообщение.Сообщить();
	Отказ = Истина;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ОборудованиеОрганизации
	Движения.ОборудованиеОрганизации.Очистить();
	Движения.ОборудованиеОрганизации.Записывать = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОборудованиеОрганизацииОстатки.Оборудование,
		|	ОборудованиеОрганизацииОстатки.СостояниеОборудования,
		|	ОборудованиеОрганизацииОстатки.ГоденДо,
		|	ОборудованиеОрганизацииОстатки.ЭксплуатироватьДо,
		|	ОборудованиеОрганизацииОстатки.КоличествоОстаток,
		|	ОборудованиеОрганизацииОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОборудованиеОрганизации.Остатки(&Дата, ГоденДо < &Дата
		|	ИЛИ ЭксплуатироватьДо МЕЖДУ ДАТАВРЕМЯ(1, 1, 1) И &Дата) КАК ОборудованиеОрганизацииОстатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ОборудованиеОрганизации.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
	КонецЦикла;


КонецПроцедуры
#КонецОбласти
#КонецЕсли
